var dialogo = {
    
    title: "termodinamica1",
    spellcheck: "auto",
    autoresize: false,
    delay: 55,
    withAudio: false,
    tts: false,
    withoutServer: true,
    styleBalloons: "img",
    "firstQuestion" : "8",
    
    questions: [
     {
        id: "8",
        text: "Diariamente calentamos cosas, ya sea en la estufa, el microondas o el horno. Pero ¿qué es lo que sucede al interior de las sustancias cuando se calientan? Vamos a remitirnos a la dimensión submicroscópica de la materia para encontrar la respuesta.<br><br>Al lado se muestra un cilindro con un gas cuyas partículas se representan como esferas. Observa y describe qué pasa con el movimiento de las partículas cuando sube la presión sobre el gas. Recuerda que, de acuerdo con la <a href='#' onclick='define(\"Ley general de los gases\")'>ley general de los gases</a>, a mayor presión, mayor temperatura.",
        display: "cilindro5",
        answers: [
          {
            RADialKey: "(((acelerar,aceleración,precipitar,vigorizarOR(aumentarANDvelocidad,movimiento,intensidad)OR(mayorANDvelocidad,intensidad)OR(másANDaltoANDvelocidad)))OR((más)AND(rápido,ágil,enérgico,veloz,intenso)))",
            feedback: "En efecto, lo que pasa cuando comprimimos un gas es que sus partículas no sólo quedan confinadas a un volumen más pequeño, también <b>aumentan su velocidad</b> cuando chocan con el émbolo en movimiento. En otras palabras: su <a href='#' onclick='define(\"Energía cinética\")'>energía cinética</a> aumentará.",
            nextQuestion: "9"
          },
          {
            RADialKey: "(((pegar,golpear,chocar,golpe)OR(rebotar,brincar,botar,saltar,rebote))AND(más))",
            feedback: "Ya comentamos que, por la reducción del volumen (y, por ende, el área), las partículas empiezan a rebotar más seguido contra las paredes del recipiente y entre ellas también. Pero, ¿no hay nada más que te llama la atención?"
          },
          {
            RADialKey: "(rápido,veloz,velocidad,rapidez)",
            feedback: "Te diste cuenta de que cambia la velocidad de las partículas cuando aumenta o disminuye la presión.",
            nextQuestion: "8_R3"
          },
          {
            feedback: "Te damos una ayudita.",
            nextQuestion: "8_R4"
          }
        ]
      },
      {
        id: "8_R3",
        text: "Pero fíjate bien. Cuando aumenta la presión, ¿se incrementa o se reduce su velocidad?",
        answers: [
          {
            RADialKey: "((incrementar,aumentar,subir,elevar,crecer)OR(másANDalto))",
            bestAnswer: "La velocidad aumenta al subir la presión.",
            feedback: "En efecto, lo que pasa cuando comprimimos un gas es que sus partículas no sólo quedan confinadas a un volumen más pequeño, también <b>aumentan su velocidad</b> cuando chocan con el émbolo en movimiento. En otras palabras: su <a href='#' onclick='define(\"Energía cinética\")'>energía cinética</a> aumentará.",
            nextQuestion: "9"
          },
          {
            RADialKey: "((reducir,bajar,disminuir)OR(másANDbajo)OR(menosANDalto))",
            bestAnswer: "La velocidad disminuye al subir la presión.",
            feedback: "¡Al contrario! Lo que pasa cuando comprimimos un gas es que sus partículas no sólo quedan confinadas a un volumen más pequeño, también <b>aumentan su velocidad</b> cuando chocan con el émbolo en movimiento. En otras palabras: su <a href='#' onclick='define(\"Energía cinética\")'>energía cinética</a> aumentará.",
            nextQuestion: "9"
          },
          { feedback: "¡Anda, no está tan difícil!" }
        ]
      },
      {
        id: "8_R4",
        text: "¿Qué puedes observar respecto a la velocidad con la que se mueven las partículas?",
        answers: [
          {
            RADialKey: "(((mayorOR(másANDalto)OR(másANDgrande)OR(másANDrápido)OR(másANDveloz)))OR((aumentar,incrementar,intensificar,crecer,subir,elevar)OR(acelerar)))",
            feedback: "Sí, se ve claramente que las partículas se mueven más rápidamente. Eso suele pasar cuando se comprime un gas: sus partículas no sólo quedan confinadas a un volumen más pequeño, también aumentan su velocidad cuando chocan con el émbolo en movimiento. En otras palabras: su <a href='#' onclick='define(\"Energía cinética\")'>energía cinética</a> aumentará.",
            nextQuestion: "9"
          },
          {
            feedback: "Puedes ver que las partículas se mueven más rápidamente. Eso suele pasar cuando se comprime un gas: sus partículas no sólo quedan confinadas a un volumen más pequeño, también aumentan su velocidad cuando chocan con el émbolo en movimiento. En otras palabras: su <a href='#' onclick='define(\"Energía cinética\")'>energía cinética</a> aumentará.",
            nextQuestion: "9"
          }
        ]
      },
      {
        id: "9",
        text: "Ahora reproduce otra vez la animación y fíjate en los valores de la <b>energía cinética media</b> de las partículas y la <b>temperatura</b> del gas. ¿Qué te llama la atención?",
        display: "cilindro6",
        answers: [
          {
            RADialKey: "((proporcional,directo)OR((mismo,igual,idéntico)AND(dirección,proporción,razón,ratio,sentido,cambiar,variar,alterar,alternar,alternancia)))",
            feedback: "Exacto, los valores de la temperatura y la energía cinética media son <i>directamente proporcionales</i>.<br><br>La temperatura de un sistema está relacionada directamente con la energía cinética de sus partículas: a medida de que ésta sea mayor, se observa que el sistema se encuentra más “caliente”; es decir, que su temperatura es mayor. En otras palabras, la <i>temperatura</i> es una medida de la <i>energía</i> de un sistema a nivel macroscópico.",
            nextQuestion: "9_b"
          },
          {
            RADialKey: "(((temperaturaANDenergía)OR(ambos,dos,2)ORtambién)AND(subir,aumentar,incrementar,elevar,crecer,bajar,disminuir,descender,reducir))OR(subir,aumentar,incrementar,elevar,crecerAND(NOT(bajar,disminuir,reducir,reducción,disminución)))",
            feedback: "Tienes razón: ambos valores siempre varían en la misma dirección.",
            nextQuestion: "9_R2"
          },
          {
            feedback: "¿No te queda claro?",
            nextQuestion: "9_R2"
          }
        ]
      },
      {
        id: "9_R2",
        text: "Cambia el valor de la presión unas cuantas veces y cada vez divide la temperatura entre el valor correspondiente de la energía cinética media de las partículas. ¿Qué obtienes? ¿Qué significa eso para relación que existe entre ambas magnitudes?",
        answers: [
          {
            RADialKey: "((proporcional)OR((mismo,igual,idéntico)AND(proporción,razón,ratio)))",
            feedback: "Exacto, los valores de la temperatura y la energía cinética media son <i>directamente proporcionales</i>.<br><br>La temperatura de un sistema está relacionada directamente con la energía cinética de sus partículas: a medida de que ésta sea mayor, se observa que el sistema se encuentra más “caliente”; es decir, que su temperatura es mayor. En otras palabras, la <i>temperatura</i> es una medida de la <i>energía</i> de un sistema a nivel macroscópico.",
            nextQuestion: "9_b"
          },
          {
            RADialKey: "((mismo,idéntico,igual)AND(valor,número,cantidad,siempre))OR(48)OR(constante)",
            feedback: "Así es, siempre se obtiene el mismo valor. Pero, ¿qué implica eso para la relación entre la temperatura y la energía cinética media de las partículas?"
          },
          {
            feedback: "Se dice que la temperatura y la energía cinética media son <i>directamente proporcionales</i>.<br><br>Esto significa que la temperatura de un sistema está relacionada directamente con la energía cinética de sus partículas: a medida de que ésta sea mayor, se observa que el sistema se encuentra más “caliente”; es decir, que su temperatura es mayor. En otras palabras, la <i>temperatura</i> es una medida de la <i>energía</i> de un sistema a nivel macroscópico.",
            nextQuestion: "9_b"
          }
        ]
      },
      {
        id: "9_b",
        text: "Ahora ya deberías de entender mejor por qué en un recipiente cerrado la presión aumenta (o disminuye) de manera proporcional con la temperatura. ¿Lo puedes explicar?",
        display: "olla",
        answers: [
          {
            RADialKey: "((rápido,velocidad,rapidez,veloz,acelerar,aceleración)MAS(((chocar,golpear,topar,colisionar,estrellar,choque,pegar,rebotar)AND(más))OR((aumentar,incrementar,subir,elevar,crecer,mayor,más)AND(presión,fuerza))))",
            feedback: "Ya lo comprendiste: debido a la aceleración de las partículas, éstas golpean más frecuentemente contra la pared del recipiente, haciendo más fuerza y, por ende, causando más presión.",
            nextQuestion: "10"
          },
          {
            RADialKey: "(chocar,rebotar,golpear,golpetear,pegar,fuerza,mover,agitar,movimiento,agitaciónANDmás)",
            feedback: "En efecto, nuevamente las partículas golpearán más frecuentemente contra las paredes del recipiente, haciendo más fuerza y, por ende, causando más presión. En este caso, el aumento en la presión no se debe a la reducción del volumen sino a la aceleración de las partículas.",
            nextQuestion: "10"
          },
          {
            RADialKey: "(rápido,velocidad,rapidez,veloz,acelerar,aceleración)",
            feedback: "Así es, a mayor temperatura, las partículas de gas se mueven con mayor velocidad. Ahora, ¿por qué aumenta entonces la presión en la olla?"
          },
          { feedback: "Recuerda la ley de Gay-Lussac (a volumen constante, la presión de un gas es directamente proporcional a su temperatura) e intenta explicarla con base en el comportamiento de las partículas del gas." },
          {
            feedback: "Recuerda que la presión es igual a la fuerza ejercida por unidad de área (P = F/A).",
            nextQuestion: "9_b_R4"
          }
        ]
      },
      {
        id: "9_b_R4",
        text: "Si una sustancia se calienta sin poder aumentar su volumen, ¿qué sucede con F y A, respectivamente?",
        answers: [
          {
            RADialKey: "((fuerza,F,f)AND(subir,aumentar,más,crecer,incrementar,elevar))MAS((área,A,a)AND(igual,mismo,constanteOR(NEG(cambiar,alterar,variar,variación,alteración))))",
            feedback: "En efecto, debido a su aceleración, las partículas empezarán a hacer más fuerza contra las paredes (cuya superficie permanece igual), por lo que habrá más presión.",
            nextQuestion: "10"
          },
          {
            feedback: "El área permanecerá igual, mientras que la fuerza aumenta, ¿no es así? Por eso, la presión (F/A) aumentará. Piénsalo: al moverse más rápido, las partículas rebotarán más, ejerciendo así más fuerza sobre la misma superficie.",
            nextQuestion: "10"
          }
        ]
      },
      {
        id: "10",
        text: "Pero hagamos memoria. Si la temperatura de un gas se eleva a medida de que éste se comprime, ¿entonces cómo es posible comprimirlo <i>a temperatura constante</i>? ¿De qué manera crees que se logra eso?",
        display: "cilindro2",
        answers: [
          {
            RADialKey: "((enfriar,refrigerar,refrigerador,hielo,frío,hielera,refri)OR((bajar,descender,disminuir,reducir)AND(temperatura))OR((absorber,quitar,eliminar,chupar)AND(calor)))",
            feedback: "Exacto, en nuestra animación de compresión <a href='#' onclick='define(\"Isotérmico\")'>isotérmica</a> faltaba la fuente fría, como una tina de agua, para evitar que el gas se caliente. Utilizamos el mismo principio cuando ponemos unos refrescos en un recipiente con agua y hielo (o el refri) para enfriarlos.",
            nextQuestion: "11",
            display: "cilindroEnTina"
          },
          {
            RADialKey: "((partícula,molécula,átomo)AND(mover,desplazar,agitar,trasladar,sacudir,brincar,chocar,golpetear,movimiento))",
            feedback: "Por ahora, no pienses en las partículas del gas sino trata de visualizar el fenómeno a nivel macroscópico.  ¿Cómo podrás mantener constante la temperatura del gas al comprimirlo?"
          },
          {
            RADialKey: "(lento,despacio,lentitud,pausadoOR(pocoANDaANDpoco))",
            feedback: "Tienes razón en que la compresión tendría que hacerse muy <i>lentamente</i> para lograr mantener constante la temperatura. Pero ¿qué más haría falta?"
          },
          {
            RADialKey: "(DUDA)",
            feedback: "En realidad, el gas sí se calentaría al comprimirlo, pero no dejamos que pase eso. ¿Cómo?"
          },
          {
            feedback: "La respuesta es muy sencilla. ",
            nextQuestion: "10_R5"
          }
        ]
      },
      {
        id: "10_R5",
        text: "Piensa en los refrescos cuando estás en la playa: ¿de qué manera evitas que se calienten?",
        answers: [
          {
            RADialKey: "((enfriar,refrigerar,refrigerador,hielo,frío,hielera,refri)OR((bajar,descender,disminuir,reducir)AND(temperatura)))",
            feedback: "Por supuesto, hay que enfriarlos. En nuestra animación de compresión <a href='#' onclick='define(\"Isotérmico\")'>isotérmica</a>, faltaba la fuente fría, como una tina de agua, para evitar que el gas se caliente.",
            nextQuestion: "11",
            display: "cilindroEnTina"
          },
          {
            RADialKey: "(tomar,beber)",
            feedback: "Tienes razón, esa sería una manera para evitar que se calentaran. ¿Pero cómo le harías, antes de tomarlos?"
          },
          {
            feedback: "Podrías colocar los refrescos en una hielera, o en un recipiente con hielo o agua fría, ¿no? De la misma manera, en nuestra animación de compresión <a href='#' onclick='define(\"Isotérmico\")'>isotérmica</a>, faltaba la fuente fría, como una tina de agua, para evitar que el gas se caliente.",
            nextQuestion: "11",
            display: "cilindroEnTina"
          }
        ]
      },
      {
        id: "11",
        text: "¿Y qué pasará entonces con el agua de la tina al comprimir el gas (o enfriar los refrescos)?",
        answers: [
          {
            RADialKey: "(((calentarOR(mayorANDtemperatura)OR(másANDaltoANDtemperatura)OR(másANDcaliente)))OR((aumentar,incrementar,subir,elevar,levantar,crecer,aumentativo,aumento)AND(temperatura)))",
            feedback: "Por supuesto, el agua se calentará un poquito. Y si esperáramos más tiempo, las temperaturas del gas y del agua terminarían por igualarse.",
            nextQuestion: "11b"
          },
          {
            feedback: "Reformulemos la pregunta con más precisión…",
            nextQuestion: "11_R2"
          }
        ]
      },
      {
        id: "11_R2",
        text: "¿Qué pasará con la <i>temperatura</i> del agua?",
        answers: [
          {
            RADialKey: "((aumentar,incrementar,subir,elevar,crecer,mayorOR(másANDalto)))",
            bestAnswer: "Subiría.",
            feedback: "Por supuesto, el agua se calentará un poquito. Y si esperáramos más tiempo, las temperaturas del gas y del agua terminarían por igualarse.",
            nextQuestion: "11b"
          },
          {
            RADialKey: "(((enfriar,refrescarOR(másANDfrío)OR(másANDbajo)OR(menosANDalto)))OR(bajar,descender,caer,disminuir,decrecer,reducir))",
            bestAnswer: "Bajaría.",
            feedback: "Sabemos que sin la presencia del agua, la temperatura del gas subiría al comprimirlo. ¿Qué sería entonces lo más lógico que pasaría con la temperatura del agua de la tina?"
          },
          {
            RADialKey: "((mismo,idéntico,igual,mismísimo)OR(NEG(cambiar,alterar,variar,variante,alternar)))",
            bestAnswer: "Se mantendría igual.",
            feedback: "Haría falta un termómetro muy preciso para registrar la diferencia en la temperatura del agua antes y después de la compresión del gas, pero sí habría una diferencia."
          }
        ]
      },
      {
        id: "11b",
        text: "Así sucederá siempre: si dos cuerpos con distinta temperatura entran en <a href='#' onclick='define(\"Contacto térmico\")'>contacto térmico</a>, la temperatura del más caliente bajará y el del más frío subirá, hasta que ambos sistemas se encuentren en equilibrio térmico.<br><br>Podemos observar este fenómeno de manera cotidiana, por ejemplo al dejar enfriar una olla con sopa, primero a temperatura ambiente y luego ¡poniéndola en el refri!<br><br>Escribe 'Listo' para seguir.",
        display: "sopa",
        answers: [
          {
            RADialKey: "(listo)",
            feedback: "¡Bien!",
            nextQuestion: "12"
          },
          {
            feedback: "Sigamos.",
            nextQuestion: "12"
          }
        ]
      },
      {
        id: "12",
        text: "Según la <b>ley cero de la termodinámica</b>, existe una determinada propiedad que es común para todos los sistemas que se encuentren en equilibrio térmico con uno dado. ¿Cuál será entonces esa propiedad?",
        answers: [
          {
            RADialKey: "(temperatura)",
            feedback: "¡Claro, la temperatura!",
            nextQuestion: "13"
          },
          { feedback: "¿De qué propiedad hemos estado hablando?" },
          {
            feedback: "¡La temperatura! Cuando varios sistemas están en equilibrio térmico con uno mismo, lo que tienen en común todos esos sistemas es la misma temperatura.",
            nextQuestion: "13"
          }
        ]
      },
      {
        id: "13",
        text: "Te invitamos a que leas <a href='#' onclick='define(\"Ley cero de la termodinámica\")'>esta cápsula</a> y observes la animación para entender mejor la relevancia de la ley cero de la termodinámica.<br><br>Después, escribe 'Listo' para seguir.",
        display: "termometros",
        answers: [
            {
                feedback: "Bien.",
                nextQuestion: "13_R1"
            }
        ]
      },
      {
        id: "13_R1",
        text: "Para averiguar si comprendiste la ley cero de la termodinámica, observa la siguiente imagen y contesta: ¿a cuál de los 3 sistemas correspondería la olla con agua de la animación anterior? Toma en cuenta que una pared <i>diatérmica</i> permite la transferencia de calor, a diferencia de una <i>adiabática</i>.",
        display: "esquemaParedes",
        answers: [
          {
            regexKey: "A",
            bestAnswer: "Sistema A",
            feedback: "Recuerda la ley cero: dos sistemas en equilibrio térmico con un tercero, están en equilibrio térmico entre sí. Reflexiona antes de elegir otra opción."
          },
          {
            regexKey: "B",
            bestAnswer: "Sistema B",
            feedback: "Recuerda que una pared diatérmica permite la transferencia de calor, una pared adiabática no. Piénsalo e intenta nuevamente."
          },
          {
            regexKey: "C",
            bestAnswer: "Sistema C",
            feedback: "Claro, en nuestro ejemplo, los dos sistemas que están en equilibrio térmico con uno mismo son los termómetros, por eso sabemos que también ellos están en equilibrio térmico entre sí. Así, gracias a la ley cero de la termodinámica, sabemos que una temperatura de 0 grados en el sistema de Celsius es igual a 32 grados según Fahrenheit.",
            nextQuestion: "14"
          }
        ]
      },
      {
        id: "14",
        text: "Nuevamente, podemos entender mejor esta ley si la estudiamos a nivel de las partículas. La siguiente animación muestra lo que sucede con las partículas de dos gases cuando se ponen en contacto térmico, gas A con temperatura inicial T<font face='SubscriptSans'>1</font> y gas B con temperatura inicial T<font face='SubscriptSans'>2</font>, siendo T<font face='SubscriptSans'>1</font> mayor que T<font face='SubscriptSans'>2</font>. Observa la simulación y escribe qué sucede con el movimiento de las partículas de ambos sistemas al cabo de un tiempo.",
        display: "transmisionCalor",
        answers: [
          {
            RADialKey: "(((mismo,idéntico,igual)OR(igualar,uniformar,nivelar,regularizar,transferir,pasar,trasladar))AND(velocidad,ritmo,rapidez,paso,rápido,veloz,movimiento))",
            feedback: "Lo entendiste bien. Debido a los choques de las partículas del sistema con mayor temperatura (A), las partículas del sistema con menor temperatura (B) empezarán a moverse cada vez más rápido, es decir: adquirirán mayor energía cinética media. En cambio, las partículas de sistema A perderán energía cinética porque la pasarán a las partículas del sistema B. Así sucederá hasta que las partículas de ambos sistemas se muevan con la misma velocidad media, es decir, cuando los sistemas tengan la misma temperatura.",
            nextQuestion: "15"
          },
          {
            RADialKey: "(DUDA)",
            feedback: "Fíjate en la velocidad de las partículas."
          },
          {
            feedback: "No te capté bien.",
            nextQuestion: "14_R2"
          }
        ]
      },
      {
        id: "14_R2",
        text: "¿Puedes volver a describir lo que observaste? Descríbelo en términos de la <i>velocidad</i> de las partículas de ambos sistemas.",
        answers: [
          {
            RADialKey: "((mismo,idéntico,igual)OR(igualar,uniformar,nivelar,regularizar))",
            feedback: "Lo entendiste bien. Debido a los choques de las partículas del sistema con mayor temperatura (A), las partículas del sistema con menor temperatura (B) empezarán a moverse cada vez más rápido, es decir: adquirirán mayor energía cinética media. En cambio, las partículas de sistema A perderán energía cinética porque la pasarán a las partículas del sistema B. Así sucederá hasta que las partículas de ambos sistemas se muevan con la misma velocidad media, es decir, cuando los sistemas tengan la misma temperatura.",
            nextQuestion: "15"
          },
          {
            feedback: "Lo que pudiste observar es que, debido a los choques de las partículas del sistema con mayor temperatura (A), las partículas del sistema con menor temperatura (B) empezarán a moverse cada vez más rápido, es decir: adquirirán mayor energía cinética media. En cambio, las partículas de sistema A perderán energía cinética porque la pasarán a las partículas del sistema B. Así sucederá hasta que las partículas de ambos sistemas se muevan con la misma velocidad media, es decir, cuando los sistemas tengan la misma temperatura.",
            nextQuestion: "15"
          }
        ]
      },
      {
        id: "15",
        text: "A nivel macroscópico, decimos que el sistema A cedió <i><b>calor</b></i> al sistema B. Con base en lo anterior, ¿puedes elaborar una definición del término <i>calor</i>?",
        answers: [
          {
            RADialKey: "((transferir,traspasar,trasladar,desplazar,intercambiar,transmitir,pasar,transferencia,transitar,tránsito,transmisión)AND(energía))MAS((((calor,calienteOR(temperaturaANDalto)))AND((fríoOR(temperaturaANDbajo))))OR((diferencia,diferente,distinto,desigualdad,desnivel,variación,diferenciar,diferir)AND(temperatura)))",
            feedback: "Se me hace que ya lo entendiste. En términos físicos, el calor no es nada más que la <b>transferencia de energía de un sistema de mayor temperatura a uno de menor temperatura</b>.<br><br>Por lo mismo un sistema en sí no puede tener <i>calor</i>, sino solo una <i>temperatura</i>, que es la medida de la energía cinética del mismo. El calor sólo existe cuando dos sistemas entran en contacto térmico, dado que el calor es energía <i>en tránsito</i>.",
            nextQuestion: "cierre"
          },
          {
            RADialKey: "((transferir,traspasar,trasladar,desplazar,intercambiar,transmitir,pasar,transferencia,transitar,tránsito,transmisión)AND(energía))",
            feedback: "Ya formulaste correctamente una parte de la definición de calor: es el intercambio de energía entre dos sistemas.",
            nextQuestion: "15_R2"
          },
          {
            RADialKey: "((transferir,traspasar,trasladar,desplazar,intercambiar,transmitir,pasar,transferencia,transitar,tránsito,transmisión)AND((movimiento,velocidad)AND(partícula,molécula)))",
            feedback: "Vas por buen camino, pero a nivel macroscópico, ¿en qué se refleja la velocidad de las partículas? Piénsalo y vuelve a formular tu respuesta de manera completa.",
            nextQuestion: ""
          },
          {
            RADialKey: "((transferir,traspasar,trasladar,desplazar,intercambiar,transmitir,pasar,transferencia,transitar,tránsito,transmisión)AND(temperatura))",
            feedback: "Cuidado, la <i>temperatura</i> es una medida de la energía interna de un sistema y no se puede trasladar de un sistema a otro. Lo que se trasmite es <i>calor</i>. Entonces, ¿cómo definirías el <i>calor</i>?",
            nextQuestion: ""
          },
          {
            RADialKey: "(temperatura)",
            feedback: "Un intercambio de calor entre dos sistemas conlleva un cambio en la temperatura de ambos. Pero tienes que ser más preciso. Intenta nuevamente.",
            nextQuestion: ""
          },
          { feedback: "Observa que, cuando el sistema A pasa su energía cinética al sistema B, a nivel macroscópico A está pasándole calor a B. ¿Cómo definirías entonces el término <i>calor</i>? Piénsalo e intenta una vez más." },
          {
            feedback: "En términos físicos, el calor no es nada más que la <b>transferencia de energía de un sistema de mayor temperatura a uno de menor temperatura</b>.<br><br>Por lo mismo un sistema en sí no puede tener <i>calor</i>, sino solo una <i>temperatura</i>, que es la medida de la energía cinética del mismo. El calor sólo existe cuando dos sistemas entran en contacto térmico, dado que el calor es energía en tránsito.",
            nextQuestion: "cierre"
          }
        ]
      },
      {
        id: "15_R2",
        text: "Ahora, ¿cuál es la condición indispensable para que esta energía transite de un sistema a otro?",
        answers: [
          {
            RADialKey: "((((calor,calienteOR(temperaturaANDalto)))AND((fríoOR(temperaturaANDbajo))))OR((diferencia,desigualdad,desnivel,variación,diferenciar,diferir,diferente,distinto)AND(temperatura))OR(másAND(frío,caliente)))",
            feedback: "¡Claro!, en términos físicos, el calor no es nada más que la <b>transferencia de energía de un sistema de mayor temperatura a uno de menor temperatura</b>.<br><br>Por lo mismo un sistema en sí no puede tener <i>calor</i>, sino solo una <i>temperatura</i>, que es la medida de la energía cinética del mismo. El calor sólo existe cuando dos sistemas entran en contacto térmico, dado que el calor es energía <i>en tránsito</i>.",
            nextQuestion: "cierre"
          },
          {
            RADialKey: "(temperatura)",
            feedback: "Vas por buen camino, pero intenta formular la idea con más precisión."
          },
          {
            feedback: "Lo que haría falta sería una diferencia en la temperatura de ambos sistemas. En términos físicos, el calor no es nada más que la transferencia de energía de un sistema de mayor temperatura a uno de menor temperatura. Por lo mismo un sistema en sí no puede tener <i>calor</i>, sino solo una <i>temperatura</i>, que es la medida de la energía cinética del mismo. El calor sólo existe cuando dos sistemas entran en contacto térmico, dado que el calor es <b>energía en tránsito</b>.",
            nextQuestion: "cierre"
          }
        ]
      },
      {
        id: "cierre",
        text: "Ya llegaste al final de este diálogo, ¡felicidades! Haz clic en el botón de Cierre para leer algunas conclusiones.",
        endDialogue: true,
        answers: []
      }
    ],
      
    microWorlds: [
        {
          id: "olla",
          url: "ollaExpress.png",
          w: 452,
          h: 465,
          front: false,
          textLink: "Ver olla a presión"
        },
        {
          id: "cilindro2",
          url: "micromundo2/index.html",
          w: 550,
          h: 560,
          front: false,
          textLink: "Ver compresión del gas"
        },
        {
          id: "cilindro5",
          url: "http://arquimedes.matem.unam.mx/_Un100_/2_Entregas/Desarrollador11/_Un_062_TermodinamicaConceptosBasicos/video/micromundo5/index.html",
          w: 456,
          h: 546,
          y: 6,
          front: false,
          textLink: "Ver compresión con partículas"
        },
        {
          id: "cilindro6",
          url: "http://arquimedes.matem.unam.mx/_Un100_/2_Entregas/Desarrollador11/_Un_062_TermodinamicaConceptosBasicos/video/micromundo5b/index.html",
          w: 456,
          h: 546,
          y: 6,
          front: false,
          textLink: "Ver compresión con partículas 2"
        },
        {
          id: "cilindroEnTina",
          url: "compresionIsotermica/index.html",
          w: 550,
          h: 560,
          front: false,
          textLink: "Ver compresión isotérmica"
        },
        {
          id: "sopa",
          url: "sopa.png",
          w: 520,
          h: 492,
          front: false,
          textLink: "Ver ilustración"
        },
        {
          id: "transmisionCalor",
          url: "http://arquimedes.matem.unam.mx/_Un100_/2_Entregas/Desarrollador11/_Un_062_TermodinamicaConceptosBasicos/video/calor/calor.html",
          w: 496,
          h: 534,
          front: false,
          textLink: "Ver transmisión de calor"
        },
        {
          id: "termometros",
          url: "termometros/termometros.html",
          w: 516,
          h: 578,
          x: 0,
          y: 0,
          front: false,
          textLink: "Ver animación con termómetros",
          reset : true
        },
        {
          id: "esquemaParedes",
          url: "esquemaParedes.png",
          w: 502,
          h: 316,
          front: false,
          textLink: "Ver esquema de paredes"
        }
    ]
};