var dialogo = {
    
    title: "termodinamica0",
    spellcheck: "auto",
    autoresize: false,
    delay: 60,
    withAudio: false,
    tts: false,
    withoutServer: true,
    styleBalloons: "img",
    "firstQuestion": "1",
    
    questions: [
      {
        id: "1",
        text: "Para comprender cómo funciona una olla a presión, conviene explorar algunos fenómenos relacionados con la compresión de los gases.<br><br>A la izquierda se muestra un gas contenido en un cilindro cerrado con un pistón. Mira la animación y contesta: ¿Qué es lo que puedes <i>observar</i> que sucede con el gas al aplicar más presión sobre él?",
        display: "cilindro1",
        answers: [
          {
            RADialKey: "((((calentar,calentamientoOR(mayorANDtemperatura)OR(másANDaltoANDtemperatura)OR(másANDcaliente)))OR((aumentar,incrementar,subir,elevar,levantar,crecer,aumentativo,aumento)AND(temperatura)))MAS((comprimir,condensar,apretar,compactarOR(menosANDgrande)OR(másANDpequeño)OR(reducir,reducción,disminuir,bajarANDvolumen))))",
            feedback: "Bien observado. Al ejercer más presión sobre el gas, éste se comprime y su temperatura aumenta un poco. Intentemos ahora <i>explicar</i> lo que observaste.",
            nextQuestion: "2"
          },
          {
            RADialKey: "((((calentar,calentamientoOR(mayorANDtemperatura)OR(másANDaltoANDtemperatura)OR(másANDcaliente)))OR((aumentar,incrementar,subir,elevar,levantar,crecer,aumentativo,aumento)AND(temperatura)))MAS(((bajar,descenderOR(moverANDhaciaANDabajo)OR(desplazarANDhaciaANDabajo)))AND(pistón,émbolo,tapa)))",
            feedback: "Bien observado.",
            nextQuestion: "1_R2_b"
          },
          {
            RADialKey: "(((bajar,descenderOR(moverANDhaciaANDabajo)OR(desplazarANDhaciaANDabajo)))AND(pistón,émbolo,tapa))",
            feedback: "Es cierto que baja el émbolo del cilindro. Pero, ¿qué sucede con el gas? Ocurren dos cosas."
          },
          {
            RADialKey: "((comprimir,condensar,apretar,encoger,compactarOR(menosANDgrande)OR(másANDpequeño)OR(reducir,reducciónANDvolumen)))",
            feedback: "En efecto, lo más evidente es la reducción en el volumen del gas.",
            nextQuestion: "1_R3"
          },
          {
            RADialKey: "(((calentar,calentamientoOR(mayorANDtemperatura)OR(másANDaltoANDtemperatura)OR(másANDcaliente)))OR((aumentar,incrementar,subir,elevar,levantar,crecer,aumentativo,aumento)AND(temperatura)))",
            feedback: "Bien observado, la temperatura del gas aumenta.",
            nextQuestion: "1_R4"
          },
          {
            RADialKey: "((manómetro)OR((presión)AND((subir,ascender,aumentar,crecer,alzar,elevar,incrementarOR(másANDalto)))))",
            feedback: "Es correcto que cuando la presión externa sobre un gas aumenta, también lo hace su presión interna; por eso sube la aguja del manómetro. Analizaremos este fenómeno más adelante. Por ahora, ¿qué otras variables cambian y cómo, además de la presión?"
          },
          { feedback: "Se observa que el émbolo del cilindro baja. ¿Qué significa eso para el gas?" },
          {
            feedback: "Lo primero que se aprecia es la reducción en el volumen del gas.",
            nextQuestion: "1_R3"
          }
        ]
      },
      {
        id: "1_R2_b",
        text: "Ahora, el que baja el pistón, ¿qué significa para el gas?",
        answers: [
          {
            RADialKey: "((comprimir,condensar,apretar,compactarOR(menosANDgrande)OR(másANDpequeño)OR(reducir,reducción,bajar,disminuirANDvolumen)))",
            feedback: "Claro, se reduce el volumen del gas.<br><br>Intentemos ahora explicar lo observado.",
            nextQuestion: "2"
          },
          {
            feedback: "Cuando el pistón baja, el volumen del gas disminuye, ¿no es cierto?<br><br>Intentemos ahora explicar lo observado.",
            nextQuestion: "2"
          }
        ]
      },
      {
        id: "1_R3",
        text: "También se observa otro fenómeno. ¿Cuál?",
        answers: [
          {
            RADialKey: "(((calentar,calentamientoOR(mayorANDtemperatura)OR(másANDaltoANDtemperatura)OR(másANDcaliente)))OR((aumentar,incrementar,subir,elevar,levantar,crecer,aumentativo,aumento)AND(temperatura)))",
            feedback: "Correcto. También aumentó un poco su temperatura. Intentemos ahora explicar lo observado.",
            nextQuestion: "2"
          },
          {
            RADialKey: "(temperatura)",
            feedback: "Ya te diste cuenta de que algo pasa con la temperatura, bien.",
            nextQuestion: "1_R3_2"
          },
          { feedback: "Vuelve a ver la animación y fíjate en el termómetro." },
          {
            feedback: "¿No te diste cuenta de que también aumentó un poco su temperatura?<br><br>Intentemos ahora explicar los fenómenos observados.",
            nextQuestion: "2"
          }
        ]
      },
      {
        id: "1_R3_2",
        text: "Sé más específico: ¿qué sucede con la temperatura?",
        answers: [
          {
            RADialKey: "((aumentar,incrementar,acrecentar,crecer,ascender,subir,elevar,mayorOR(másANDalto)OR(másANDgrande)))",
            feedback: "Así es. A continuación vamos a tratar de explicar lo sucedido.",
            nextQuestion: "2"
          },
          {
            feedback: "¿No te percataste de que la temperatura del gas se eleva?<br><br>Tratemos ahora de explicar los dos fenómenos observados.",
            nextQuestion: "2"
          }
        ]
      },
      {
        id: "1_R4",
        text: "También tiene lugar otro fenómeno más evidente. ¿Cuál?",
        answers: [
          {
            RADialKey: "((comprimir,condensar,encoger,apretar,compactarOR(menosANDgrande)OR(másANDpequeño)OR(reducir,reducciónANDvolumen)))",
            feedback: "Claro, antes que nada se empieza a reducir el volumen del gas. Intentemos ahora explicar lo observado.",
            nextQuestion: "2"
          },
          {
            RADialKey: "(((bajar,descenderOR(moverANDhaciaANDabajo)OR(desplazarANDhaciaANDabajo)))AND(pistón,émbolo,tapa))",
            feedback: "Cierto, el pistón baja. ¿Qué implica eso para el gas?"
          },
          { feedback: "Puedes ver que el pistón del cilindro baja. ¿Qué implica eso para el gas?" },
          {
            feedback: "Antes que nada se empieza a reducir el volumen del gas. Intentemos ahora explicar lo observado.",
            nextQuestion: "2"
          }
        ]
      },
      {
        id: "2",
        text: "Para explicar la primera parte del fenómeno observado, la reducción del volumen del gas, vamos  a estudiar únicamente las variables <b>presión</b> (P) y <b>volumen</b> (V) del sistema. Por ahora eliminamos la tercera variable, la temperatura; es decir, la mantendremos constante.<br><br>Observa la animación. Después, con base en los datos obtenidos, escribe lo que te llama la atención respecto a la <i>relación</i> que existe entre la presión y el volumen.",
        display: "cilindro2",
        answers: [
          {
            RADialKey: "((((volumen)AND((reducir,disminuir,contraer,encoger,condensar,comprimir,bajar,menorOR(menosANDgrande)OR(másANDpequeño))))MAS((presión)AND((aumentar,incrementar,acrecentar,crecer,ascender,subir,elevar,agrandar,ampliar,extender,mayorOR(másANDalto)OR(másANDgrande)))))AND(((mismo,idéntico,equivalente,igual)AND(proporción,razón,magnitud,dimensión))OR(proporcional,proporcionalidad)))OR(multiplicar,productoANDmismo,igual,constante,idéntico,12,doce)",
            feedback: "Observaste bien que el volumen se reduce en la misma proporción en que aumenta la presión. Se dice que estas magnitudes son <b>“inversamente proporcionales”</b>. Y lo que acabas de descubrir es la <b>ley de Boyle</b>, que establece que, a temperatura constante, el volumen de un gas en un recipiente cerrado es inversamente proporcional a la presión ejercida sobre él.<br><br>La expresión matemática de esta ley es <b>P*V = k</b>, lo que indica que el producto de la presión por el volumen es una constante (k).<br><br>Vuelve a bajar el pistón en la animación para corroborar el valor constante de k.",
            nextQuestion: "3",
            display: "cilindro3"
          },
          {
            RADialKey: "(inversoANDproporcional)",
            feedback: "¡Excelente! Acabas de descubrir la <b>ley de Boyle</b>, que establece que, a temperatura constante, el volumen de un gas en un recipiente cerrado es inversamente proporcional a la presión ejercida sobre él.<br><br>La expresión matemática de esta ley es <b>P*V = k</b>, lo que indica que el producto de la presión por el volumen es una constante (k).<br><br>Vuelve a bajar el pistón en la animación para corroborar el valor constante de k.",
            nextQuestion: "3"
          },
          {
            RADialKey: "(((subir,ascender,aumentar,elevar,incrementar,alzar,crecer,arriba,mayorOR(másANDalto))AND(bajar,descender,caer,disminuir,decrecer,reducir,abajo,menorOR(másANDpequeño)))OR((sentido,rumbo,dirección)AND(opuesto,contrario))OR(inverso))",
            feedback: "Es cierto que varían en sentido contrario: si sube la presión, el volumen se reduce y viceversa. Ahora multiplica los distintos valores de presión por los valores correspondientes de volumen.",
            nextQuestion: "2_R3"
          },
          {
            RADialKey: "(((presiónANDvolumen)ORambo,dos,2)AND(subir,aumentar,incrementar,elevar,crecer,mayorOR(másANDalto)))",
            feedback: "¿Dijiste que ambos valores <i>suben</i>? ¡Fíjate bien!",
            nextQuestion: ""
          },
          {
            RADialKey: "(((presiónANDvolumen)ORambo,dos,2)AND(bajar,disminuir,disminución,decrecer,reducir,reducción,menorOR(másANDpequeño)))",
            feedback: "¿Dijiste que ambos valores <i>disminuyen</i>? ¡Fíjate bien!",
            nextQuestion: ""
          },
          {
            feedback: "Multiplica los distintos valores de presión por los valores correspondientes de volumen.",
            nextQuestion: "2_R3"
          }
        ]
      },
      {
        id: "2_R3",
        text: "¿Qué es lo que encuentras?",
        answers: [
          {
            RADialKey: "((constante)OR((mismo,idéntico,igual,fijo)AND((valor,númeroOR(cantidadANDnumérico))))OR(12,doce))",
            feedback: "¡Así es! Acabas de descubrir la <b>ley de Boyle</b>, que establece que, a temperatura constante, el volumen de un gas en un recipiente cerrado es <b><i>inversamente proporcional</i></b> a la presión ejercida sobre él. Esto significa que cuando la presión aumenta, el volumen se reducirá en la misma proporción. Por ejemplo, si la presión se duplica, el volumen se reducirá a la mitad.<br><br>La expresión matemática de esta ley es <b>P*V = k</b>, lo que indica que el producto de la presión por el volumen es una constante (k).",
            nextQuestion: "2_R3_2",
            display: "cilindro3"
          },
          {
            RADialKey: "(mismo,igual,idéntico,fijo)OR(NEG(cambiar,alterar,variar))",
            feedback: "Siempre es el mismo... ¿qué? Escribe la respuesta completa."
          },
          {
            feedback: "¿No notaste que el producto de la presión por el volumen es una <b>constante</b>? Esto significa que cuando la presión aumenta, el volumen se reduce en la misma proporción, y viceversa.<br><br>Se dice que la presión y el volumen son “inversamente proporcionales” y es justamente eso lo que establece una importante ley de los gases, la <b>ley de Boyle</b>: a temperatura constante, el volumen de un gas en un recipiente cerrado es inversamente proporcional a la presión ejercida sobre él.",
            nextQuestion: "2_R3_2",
            display: "cilindro3"
          }
        ]
      },
      {
        id: "2_R3_2",
        text: "Vuelve a bajar el pistón en la animación para corroborar el valor constante de <i>k</i>. Después escribe 'Listo' para seguir.",
        answers: [
          {
            RADialKey: "(listo)",
            feedback: "Bien.",
            nextQuestion: "3"
          },
          {
            feedback: "Sigamos de todos modos.",
            nextQuestion: "3"
          }
        ]
      },
      {
        id: "3",
        text: "Ahora tenemos a nuestro gas contenido en un espacio menor, ejerciendo sobre él una mayor presión. ¿Qué crees que sucedería si redujéramos nuevamente la fuerza ejercida sobre el pistón?",
        answers: [
          {
            RADialKey: "((volumen)AND((aumentar,incrementar,acrecentar,crecer,subir,elevar,agrandar,aumento,mayorOR(menosANDpequeño)OR(másANDgrande))))OR((subir,ascender,levantar,elevar,montar,arriba,expandir))",
            feedback: "Así es, el pistón volvería a subir, por lo que el volumen del gas incrementaría de nuevo. Esto se debe a que la magnitud de la presión <i>externa</i> de un gas es idéntica a la presión <i>interna</i> del mismo, es decir, la que ejerce sobre el entorno que lo confina.",
            nextQuestion: "4"
          },
          {
            feedback: "Quizá la pregunta no sea suficientemente clara.",
            nextQuestion: "3_R2"
          }
        ]
      },
      {
        id: "3_R2",
        text: "Lo que queremos saber es qué sucederá con el <i>volumen</i> del gas al bajar la presión sobre el pistón.",
        answers: [
          {
            RADialKey: "((aumentar,incrementar,acrecentar,crecer,ascender,subir,elevar,agrandar,expandir,extender,aumentativo,aumento,mayorOR(menosANDpequeño)OR(másANDgrande)))",
            feedback: "Claro, el pistón volvería a subir, por lo que el volumen del gas incrementaría de nuevo. Esto se debe a que la presión <i>externa</i> ejercida sobre un gas tiene la misma magnitud que la presión <i>interna</i> del mismo, es decir, la que ejerce sobre el entorno que lo confina.",
            nextQuestion: "4"
          },
          {
            feedback: "El pistón volvería a subir. Esto se debe a que la presión <i>externa</i> ejercida sobre un gas tiene la misma magnitud que la presión <i>interna</i> del mismo, es decir, la que ejerce sobre el entorno que lo confina.",
            nextQuestion: "4"
          }
        ]
      },
      {
        id: "4",
        text: "Lo podrás entender perfectamente si piensas en una jeringa 'vacía', es decir: llena del gas llamado <i>aire</i>. Si mantienes tapada con un dedo la boca y empiezas a empujar con el pulgar sobre el émbolo, lograrás comprimir un poco el aire dentro de la jeringa. Pero en cuanto sueltes el pulgar, el émbolo se regresará a su posición inicial, debido a la presión interna con la que el aire “empuja” las paredes.<br><br>Escribe 'Listo' para seguir.",
        display: "jeringa",
        answers: [
          {
            RADialKey: "(listo)",
            feedback: "Ok.",
            nextQuestion: "5"
          },
          {
            feedback: "No te entendí.",
            nextQuestion: "4_R2"
          }
        ]
      },
      {
        id: "4_R2",
        text: "¿Estás list@ para seguir?",
        answers: [
          {
            RADialKey: "(SÍ)",
            bestAnswer: "Sí.",
            feedback: "Perfecto.",
            nextQuestion: "5"
          },
          {
            RADialKey: "(listo)",
            feedback: "Perfecto.",
            nextQuestion: "5"
          },
          {
            RADialKey: "(NO)",
            bestAnswer: "No.",
            feedback: "Hmmm. ¿No te quedó claro el ejemplo de la jeringa? Entonces haz el experimento en tu casa y verás cómo puedes comprimir un poco el aire dentro de la jeringa, pero ¡tendrás que mantener el pulgar bien apretado para que el émbolo no se regrese!<br><br>Sigamos pues.",
            nextQuestion: "5"
          }
        ]
      },
      {
        id: "5",
        text: "Podemos explicar el aumento en la presión interna del gas haciendo un acercamiento a su <b>estructura molecular</b>.<br><br>Lee el texto y reproduce el video para ver qué sucede con las partículas si elevamos la presión sobre el gas. Después trata de explicar el aumento en la presión interna del gas en función del movimiento y los choques de las partículas.",
        display: "cilindro4",
        answers: [
          {
            RADialKey: "(((acelerar,precipitar,vigorizarOR(aumentar,subir,incrementarANDvelocidad,movimiento)OR(mayorANDvelocidad)OR(másANDaltoANDvelocidad)))OR((más)AND(rápido,ágil,enérgico,veloz,movimiento,velocidad)))",
            feedback: "Fíjate bien. Podría parecer que las partículas se mueven más rápido, pero no es el caso. ¿Por qué dan la impresión de moverse más velozmente?"
          },
          {
            RADialKey: "(((pegar,golpear,chocar,golpe)OR(rebotar,brincar,botar,saltar,rebote))AND(más))",
            feedback: "En efecto, las partículas empezarán a golpear más seguido contra la pared del sistema porque están confinadas a un área más pequeña. Por lo mismo, ejercerán más presión.",
            nextQuestion: "5_a"
          },
          {
            RADialKey: "(((disminuir,reducir,contraer,encoger,bajar,menorOR(másANDpequeño)OR(menosANDgrande)))AND(área,superficie,pared,espacio))",
            feedback: "En efecto, las partículas están confinadas a un área más pequeña. ¿Qué consecuencia tiene eso?"
          },
          {
            feedback: "Para poder explicar el fenómeno, considera que la presión es igual a la fuerza dividida por el área: <b>P = F/A</b>.",
            nextQuestion: "5_b"
          }
        ]
      },
      {
        id: "5_a",
        text: "Podemos entenderlo más fácilmente si consideramos la fórmula matemática de la presión: <b>P = F/A</b> (presión = fuerza ejercida por unidad de área). Aquí la fuerza de las partículas (F) no cambia pero el área total del cilindro (A) disminuye. Por eso la presión (F/A) es mayor.<br><br>¿Te queda claro eso?",
        answers: [
          {
            RADialKey: "(SÍ)",
            feedback: "Perfecto.",
            nextQuestion: "6"
          },
          {
            RADialKey: "(NO)",
            feedback: "Ok.",
            nextQuestion: "5_a_R2"
          },
          { feedback: "¿Entendiste lo anterior? Contesta con un simple 'sí' o 'no'." },
          {
            feedback: "Bueno, vamos a seguir.",
            nextQuestion: "6"
          }
        ]
      },
      {
        id: "5_a_R2",
        text: "¿Qué parte no entendiste?",
        answers: [
          {
            RADialKey: "(área,A,a)",
            feedback: "Recuerda que el área del cilindro es igual a su perímetro por su altura; si disminuye la altura, disminuye el área.",
            nextQuestion: "6"
          },
          {
            RADialKey: "(fuerza)",
            feedback: "Recuerda que cuando las partículas rebotan contra la superficie del cilindro, ejercen <i>fuerza</i> sobre él. Y si esa fuerza se ejerce sobre un área más pequeña, entonces la presión será mayor, porque la misma fuerza (F) se divide entre un valor menor (A).",
            nextQuestion: "6"
          },
          {
            feedback: "Te lo vuelvo a explicar.  Primero, recuerda que el área del cilindro es igual a su perímetro por su altura; si disminuye la altura, disminuye el área. Luego, ten presente que cuando las partículas rebotan contra la superficie del cilindro, ejercen <i>fuerza</i> sobre él. Y si esa fuerza se ejerce sobre un área más pequeña, entonces la presión será mayor, porque la misma fuerza (F) se divide entre un valor menor (A).",
            nextQuestion: "6"
          }
        ]
      },
      {
        id: "5_b",
        text: "Ahora observa lo que sucede con F y A, y reflexiona: ¿qué consecuencia tiene para los choques de las partículas contra las paredes?",
        answers: [
          {
            RADialKey: "(((pegar,golpear,chocar,golpe)OR(rebotar,brincar,botar,saltar,rebote))AND(más))",
            feedback: "En efecto, las partículas empezarán a golpear más seguido contra la pared del sistema. Esto se debe a que están confinadas a un área más pequeña (A), mientras que su fuerza (F) permanece igual. Por lo mismo, ejercerán más presión.",
            nextQuestion: "6"
          },
          {
            RADialKey: "(((área,superficie,A,a)AND((disminuir,reducir,encoger,contraer,empequeñecer,decrecer,descender,bajarOR(másANDpequeño)OR(menosANDgrande))))MAS((fuerza,F)AND((igual,mismo,idéntico)OR(NEG(cambiar,alterar,variar,transformar,achicar)))))",
            feedback: "En efecto, las partículas están confinadas a un área (A) más pequeña, pero su fuerza (F) permanece igual. Con base en eso, ¿qué dices del comportamiento de las partículas?"
          },
          {
            RADialKey: "((fuerza,F,velocidad)AND(aumentar,subir,mayor,elevar,crecerOR(másANDgrande)))",
            feedback: "Fíjate bien. Podría parecer que las partículas se mueven más rápido, pero no es el caso. ¿Por qué dan la impresión de moverse más velozmente?"
          },
          {
            RADialKey: "((área,superficie,A,a)AND((disminuir,reducir,encoger,contraer,empequeñecer,decrecer,descender,bajarOR(másANDpequeño)OR(menosANDgrande))))",
            feedback: "En efecto, las partículas están confinadas a un área (A) más pequeña, pero ¿qué sucede con su fuerza (F)? ¿Y qué implica eso para el comportamiento de las partículas?"
          },

          {
            feedback: "Las partículas están confinadas a un área (A) más pequeña; sin embargo, su fuerza (F) permanece igual. Por lo mismo, empezarán a golpear más seguido contra la pared del sistema, por lo que ejercerán más presión.",
            nextQuestion: "6"
          }
        ]
      },
      {
        id: "6",
        text: "Regresemos ahora a nuestro caso inicial, donde la temperatura sí varía. Utiliza los pulsadores para manipular los valores de presión, volumen y temperatura y fíjate sobre todo en la relación presión-volumen. ¿Hay algo que te llama la atención? ¿Qué?",
        display: "cilindro5",
        answers: [
          {
            RADialKey: "(((NEG(mismo,idéntico,igual,mismísimo)AND(NEG(proporción,razón)))OR(NEG(proporcional,proporcionalidad)))OR((volumen)AND((disminuir,reducir,contraer,encoger,bajar,decrecer,reducciónOR(másANDpequeño)OR(menosANDgrande)))AND((NEG(tanto,mismo,igual))OR(menos))))",
            feedback: "Lo observaste bien. En este caso, la presión aumenta y el volumen del gas disminuye, pero no en la misma proporción: con el mismo aumento en la presión, el volumen disminuye menos debido a que aumenta la temperatura del gas.",
            nextQuestion: "7"
          },
          {
            RADialKey: "(proporción,proporcional)",
            feedback: "¡Al contrario! En este caso, la presión aumenta y el volumen del gas disminuye, pero <b>no en la misma proporción</b>: con el mismo aumento en la presión, el volumen disminuye menos debido a que aumenta la temperatura del gas. ",
            nextQuestion: "7"
          },
          {
            feedback: "Recuerda lo que constatamos anteriormente respecto a la presión y el volumen: a temperatura constante, se relacionan de manera inversamente proporcional. ",
            nextQuestion: "6_R2"
          }
        ]
      },
      {
        id: "6_R2",
        text: "¿Es el caso aquí?",
        answers: [
          {
            RADialKey: "(NO)",
            bestAnswer: "No",
            feedback: "En efecto, en este caso, la presión aumenta y el volumen del gas disminuye, pero no en la misma proporción: con el mismo aumento en la presión, el volumen disminuye menos debido a que aumenta la temperatura del gas.",
            nextQuestion: "7"
          },
          {
            RADialKey: "(SÍ)",
            bestAnswer: "Sí",
            feedback: "Pues no. En este caso, la presión aumenta y el volumen del gas disminuye, pero no en la misma proporción: con el mismo aumento en la presión, el volumen disminuye menos debido a que aumenta la temperatura del gas.",
            nextQuestion: "7"
          },
          { feedback: "¿No estás seguro? Recuerda que al ser dos valores inversamente proporcionales, cuando uno aumenta el otro bajará en la misma proporción. ¿La presión y el volumen se comportan así en este ejemplo?" }
        ]
      },
      {
        id: "7",
        text: "Con base en lo anterior, ¿cuál de las fórmulas que se muestran a la izquierda expresa correctamente la relación entre las magnitudes presión (P), volumen (V) y temperatura (T) en un gas cualquiera? Selecciona la que consideres correcta, tomando en cuenta que <i>k</i> es una constante (es decir, un valor fijo) que depende de las características del gas y la variable <i>n</i> expresa la cantidad del mismo (aquí, este valor también se mantiene fijo).",
        display: "formulas",
        answers: [
          {
            regexKey: "P/V",
            bestAnswer: "P/V = knT",
            feedback: "Cuidado, si ésta fuera la fórmula correcta, entonces al subir la presión ejercida sobre el gas, <i>bajaría</i> su temperatura en vez de aumentar. Veamos por qué.<br><br>Ya establecimos que al aumentar la presión, el volumen disminuye pero no en la misma proporción; disminuye menos. Por eso, se estaría dividiendo el valor de la presión entre un valor de volumen relativamente mayor, lo que daría un valor menor para la temperatura, cuando en realidad debería ser mayor.<br><br>Sabiendo esto, ya puedes elegir la fórmula correcta."
          },
          {
            regexKey: "^PV",
            bestAnswer: "PV = knT",
            feedback: "Ésta es, en efecto, la fórmula de la <b>ley general de los gases</b>. Indica que <b>la temperatura de un gas es proporcional al producto de su presión y volumen</b>.<br><br>Esto es consistente con el comportamiento que habíamos observado: al subir la presión (P), la temperatura (T) aumenta, y eso se debe a que el volumen disminuye pero no tanto como en el caso inversamente proporcional. Por eso, cuanto mayor sea la presión, mayor será el producto P*V, es decir, la temperatura.",
            nextQuestion: "8"
          },
          {
            regexKey: "nPVT",
            bestAnswer: "nPVT = k",
            feedback: "Esta fórmula no tiene sentido en vista del fenómeno observado. Analicemos por qué.<br><br>Sabemos que al aumentar la presión, el volumen baja, pero menos que en el caso isotérmico (a temperatura constante), donde el producto P*V es una constante. Además sabemos que la temperatura subirá también. En estas condiciones, el producto nPVT nunca puede ser una constante (k), ya que con cada aumento en la presión, el producto será cada vez mayor.<br><br>Elige nuevamente."
          },
          { feedback: "Simplemente elige la fórmula que consideres correcta seleccionándola del lado izquierdo." }
        ]
      },
      {
        id: "8",
        text: "En los experimentos que hemos realizado, siempre había el mismo gas y en la misma cantidad, así que podemos abreviar la fórmula de la ley de los gases así: <b>P*V = T</b>.<br><br>Regresemos ahora con nuestra olla a presión. ¿Cuál de estas tres variables se mantiene constante cuando cocinamos alimentos en ella?",
        display: "olla",
        answers: [
          {
            RADialKey: "(P,p,presión)",
            bestAnswer: "La presión",
            feedback: "La presión dentro de la olla NO se mantendrá constante sino aumentará y es justamente ese aumento en la presión que forma la base de su funcionamiento. ¿Cuál es entonces la variable que se mantiene constante?"
          },
          {
            RADialKey: "(V,v,volumen)",
            bestAnswer: "El volumen",
            feedback: "Claro, en la olla a presión, la única variable de las tres que no varía es el volumen disponible (dentro de la olla). ",
            nextQuestion: "9"
          },
          {
            RADialKey: "(T,t,temperatura)",
            bestAnswer: "La temperatura",
            feedback: "Piensa: si prendemos la estufa, ¿crees que la temperatura al interior de la olla se mantendrá constante? ¡Claro que no!<br><br>¿Cuál es entonces la variable que sí se mantiene constante?"
          }
        ]
      },
      {
        id: "9",
        text: "Y al mantenerse constante el volumen, ¿cómo crees que se relacionarán la temperatura y la presión?",
        answers: [
          {
            RADialKey: "(((subir,ascender,aumentar,elevar,incrementar,alzar,crecer,arriba)AND(bajar,descender,caer,disminuir,decrecer,reducir,abajo))OR((sentido,rumbo,dirección)AND(opuesto,contrario))OR(inverso,inversamente))",
            feedback: "¡Se me hace que contestaste sin pensar! Recuerda la ley de los gases: PV = knT. En este caso, tanto <i>V</i> (el volumen) como <i>k</i> y <i>n</i> son constantes. ¿Cómo se relacionarán entonces las variables P y T?"
          },
          {
            RADialKey: "(((proporcional,proporcionalidad,directoOR(mismaANDproporción)))OR((subir,ascender,elevar,incrementar,aumentar,bajar,disminuir,reducir)AND((ambos,dos)OR((temperatura)AND(presión))))OR((variar,cambiar,mover,dirección,sentido)AND(mismo,igual))OR((aumentar,subir,incrementar,elevar,alzar,crecer,arriba,mayorOR(másANDalto))AND(NOT(bajar,disminuir,disminución,reducir,reducción,menor))))",
            feedback: "Así es, al subir la temperatura, la presión aumentará en la misma proporción y viceversa. Ya descubriste otra famosa ley de los gases: la <b>ley de Gay-Lussac</b>, según la cual a volumen constante, la presión de un gas es directamente proporcional a su temperatura.",
            nextQuestion: "10"
          },
          { feedback: "Piensa: la ley general de los gases indica que la temperatura de un gas es proporcional al producto de su presión y volumen. Si el volumen no cambia, ¿qué crees que sucederá con la temperatura y la presión?" },
          {
            feedback: "Según otra famosa ley de los gases, la ley de Gay-Lussac, a volumen constante, la presión de un gas es directamente proporcional a su temperatura. Esto significa que al subir la temperatura, la presión aumentará en la misma proporción, y viceversa.",
            nextQuestion: "10"
          }
        ]
      },
      {
        id: "10",
        text: "Entonces, ¿por qué los alimentos se cocinan más rápidamente en una olla a presión? Trata de encontrar la respuesta tú solo (sin escribirla), tomando en cuenta que a mayor presión, el <a href='#' onclick='define(\"Punto de ebullición\")'>punto de ebullición</a> de las sustancias se eleva. Después, avanza al cierre para consultar la respuesta.",
        display: "",
        endDialogue: true,
        answers: []
      }
    ],
    
    microWorlds: [
        {
          id: "olla",
          url: "ollaExpress.png",
          w: 452,
          h: 465,
          front: false,
          textLink: "Ver olla a presión"
        },
        {
          id: "cilindro1",
          url: "micromundo1/index.html",
          w: 550,
          h: 560,
          y: 0,
          front: false,
          textLink: "Ver compresión gas"
        },
        {
          id: "cilindro2",
          url: "micromundo2/index.html",
          w: 550,
          h: 560,
          y: 0,
          front: false,
          textLink: "Ver compresión a temperatura constante"
        },
        {
          id: "cilindro3",
          url: "micromundo2b/index.html",
          w: 550,
          h: 560,
          y: 0,
          front: false,
          textLink: "Ver compresión a temperatura constante (2)"
        },
        {
          id: "cilindro4",
          url: "micromundo3/index.html",
          w: 456,
          h: 540,
          y: 5,
          front: false,
          textLink: "Ver compresión con partículas"
        },
        {
          id: "cilindro5",
          url: "micromundo4/index.html",
          w: 550,
          h: 560,
          y: 0,
          front: false,
          textLink: "Ver compresión con manipulación variables"
        },
        {
          id: "jeringa",
          url: "jeringa.png",
          w: 451,
          h: 467,
          front: false,
          textLink: "Ver imagen jeringa"
        },
        {
          id: "formulas",
          url: "formulasLeyGases.html",
          w: 280,
          h: 278,
          front: false,
          textLink: "Ver fórmulas"
        },
        {
          id: "ollaFinal",
          url: "ollaExpress/ollaExpress.html",
          w: 550,
          h: 560,
          y: 0,
          front: false
        }
    ]
    
};